app/controllers/accounts_controller.rb

SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 89 LIMIT 1
---
  def set_account
    @account = Account.find(params[:id]) or not_found