app/controllers/payments_controller.rb

  def new
    @accounts = Account.where(:customer_id=> session[:id])
    @payment = Payment.new
    status  = Status.where(:name=>Constants::PAYMENT_CREATED_STATUS).first
---
SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 1 LIMIT 1
SELECT  `statuses`.* FROM `statuses`  WHERE `statuses`.`name` = 'created'  ORDER BY `statuses`.`id` ASC LIMIT 1

  def create
    @account = Account.find(payment_params[:account_id])
    @account_detail = @client.get_account_detail(@account.account_fidor_id)
    @payment = Payment.new(payment_params)
    if @account_detail.can_transfer?(payment_params['amount'])
      @payment.account = @account
      status  = Status.where(:name=>Constants::PAYMENT_CREATED_STATUS).first
      @payment.status = status
      @payment.uuid = SecureRandom.uuid
      respond_to do |format|
        if @payment.save
---
SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 1 LIMIT 1
SELECT  `statuses`.* FROM `statuses`  WHERE `statuses`.`name` = 'Open'  ORDER BY `statuses`.`id` ASC LIMIT 1
INSERT INTO `payments` (`account_id`, `amount`, `bic`, `created_at`, `currency`, `iban`, `status_id`, `transaction_number`, `updated_at`) VALUES (158, '094', '1757871476', '2015-02-06 13:31:31', 'euro', '8040711083', 75, '-', '2015-02-06 13:31:31')

  def mtan
	  @payment = Payment.find(params[:id])
---
SELECT  `payments`.* FROM `payments`  WHERE `payments`.`id` = 25 LIMIT 1