app/controllers/transactions_controller.rb

  def set_account
    @account = Account.find(params[:account_id])
---
SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 2 LIMIT 1